#include <stdio.h>
int main() 
{
    float a = 0.617; // ประกาศตัวแปร a
    printf("a=%6.3f%%\n",a) ;      // แสดงผลตัวแปร a ช่องกว้าง 6 ชิดขวา ทศนิยม 3 ตำแหน่ง

    int b = 25; // ประกาศตัวแปร b
    printf("b=%4d%%\n", b);       // แสดงผลตัวแปร b ในรูปแบบจำนวนเต็ม 6 หลัก

    float c = 19.0; //ประกาศตัวแปร c
    printf("c =%6.3f%%\n", c);       // แสดงผลตัวแปร c ช่องกว้าง 6 ชิดขวา ทศนิยม 2 ตำแหน่ง

    int d = 9; //  ประกาศตัวแปร d
    printf("d  =%-2d%%\n", d);       // แสดงผลตัวแปร d ในรูปแบบจำนวนเต็ม ช่องกว้าง 2 ชิดซ้าย

    float  e = 124.555; //  ประกาศตัวแปร e
    printf("e=%7.3f%%\n", e);       // แสดงผลตัวแปร e ช่องกว้าง 7 ชิดขวา ทศนิยม 3 ตำแหน่ง

    float f= 0.001; // ประกาศตัวแปร f
    printf("f=%5.3f%%\n", f);       // แสดงผลตัวแปร f ช่องกว้าง 5 ชิดขวา ทศนิยม 3 ตำแหน่ง

    return 0; 
}
