#include <stdio.h> 

int main() {

char name[3]; // ประกาศตัวแปรชื่อ
int age[3]; // ประกาศตัวแปรอายุ ขอบเขต 3 ตัวอักษร
float height[3]; // ประกาศตัวแปรส่วสูง ขอบเขต 3 ตัวอักษร
float weight[3]; // ประกาศตัวแปรน้ำหนัก ขอบเขต 3 ตัวอักษร
char grade[3]; // ประกาศตัวแปรเกรด ขอบเขต 3 ตัวอักษร

// รับข้อมูลจากผู้ใช้จำนวน 3 คน โดยรับข้อมูลต่อเนื่องใน 1 บรรทัด (1 คน)
for (int i = 0; i < 3; i++) {
printf("User %d (name age height weight grade): ", i + 1);

// รับค่า ชื่อ อายุ ส่วนสูง น้ำหนัก และเกรด
// %c ตัวอักษร %d จำนวนเต็ม %f ทศนิยม

scanf(" %c %d %f %f %c", &name[i], &age[i], &height[i], &weight[i], &grade[i]);
}

// แสดงผลแบบตาราง 
printf("\n+-------+-----+------------+-----------+-------------+\n");
printf("| %-5s | %-3s | %-10s | %-9s | %-11s |\n",
"Name", "Age", "Height(cm)", "Weight(kg)", "Grade Code");
printf("+-------+-----+------------+-----------+-------------+\n");

// แสดงผลข้อมูลของผู้ใช้ทั้ง 3 คน 
for (int i = 0; i < 3; i++) {
printf("| %-5c | %-3d | %-10.1f | %-9.1f | %-11c |\n",
name[i], age[i], height[i], weight[i], grade[i]);
}

printf("+-------+-----+------------+-----------+-------------+\n");

return 0; 
}